---

C#Visual BasicVisual C++

Revit 2024 API
---
FamilyManager..::..Parameter Property (String)
FamilyManager Class See Also Send Feedback
---

Obtains the parameter of this type with a given name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public FamilyParameter this[
    	string parameterName
    ] { get; }

Visual Basic
---

    Public ReadOnly Property Parameter ( _
    	parameterName As String _
    ) As FamilyParameter
    	Get

Visual C++
---

    public:
    property FamilyParameter^ Parameter[String^ parameterName] {
    	FamilyParameter^ get (String^ parameterName);
    }

#### Parameters

parameterName
    Type: System..::..String

# Remarks

Returns nullNothingnullptra null reference (Nothing in Visual Basic) if the parameter is not found.

# See Also

FamilyManager Class

Parameter Overload

Autodesk.Revit.DB Namespace